; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared1 - mode
	image0 - mode
	thermograph2 - mode
	thermograph3 - mode
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph3)
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(pointing satellite0 Star8)
	(have_image Planet7 infrared1)
	(have_image Star8 infrared1)
	(have_image Star9 image0)
	(have_image Star10 thermograph2)
	(have_image Star11 infrared1)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 planet7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet7)
   goals met: 0 of 8
5. (take_image satellite0 planet7 instrument0 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 1 of 8
6. (turn_to satellite0 planet13 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet13)
   goals met: 1 of 8
7. (take_image satellite0 planet13 instrument0 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon12 instrument0 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 3 of 8
10. (turn_to satellite0 star10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star10)
   goals met: 3 of 8
11. (take_image satellite0 star10 instrument0 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 4 of 8
12. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 4 of 8
13. (take_image satellite0 star11 instrument0 infrared1)
   added: (have_image star11 infrared1)
   goals met: 5 of 8
14. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 5 of 8
15. (take_image satellite0 star9 instrument0 image0)
   added: (have_image star9 image0)
   goals met: 6 of 8
16. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 7 of 8
17. (take_image satellite0 star8 instrument0 infrared1)
   added: (have_image star8 infrared1)
   goals met: 8 of 8
